<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use function Laravel\Prompts\table;

class DisciplineSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('disciplines')->insert([
            ['name' => 'История'],
            ['name' => 'Иностранный язык'],
            ['name' => 'Русский язык и культура речи'],
            ['name' => 'Философия'],
            ['name' => 'Введение в специальность'],
            ['name' => 'Социология'],
            ['name' => 'Правоведение'],
            ['name' => 'Культурология'],
            ['name' => 'Основы российской государственности'],

            ['name' => 'Физика'],
            ['name' => 'Высшая математика'],
            ['name' => 'Дискретная математика'],
            ['name' => 'Основы программирования'],
            ['name' => 'Web-программирование'],
            ['name' => 'Моделирование и проектирование систем'],
            ['name' => 'Программирование мобильных устройств'],
            ['name' => 'Базы данных'],
            ['name' => 'Компьютерные сети'],
            ['name' => 'Экономика и менеджмент'],

            ['name' => 'Бизнес-анализ'],
            ['name' => 'Экономика предприятия'],
            ['name' => 'Управление проектами'],
            ['name' => 'Цифровой маркетинг'],

            ['name' => 'Криптография'],
            ['name' => 'Защита сетей'],
            ['name' => 'Реверс-инжинеринг'],

            ['name' => 'Электроника'],
            ['name' => 'Радиоприёмные устройства'],
            ['name' => 'Антенны и распространение волн'],
            ['name' => 'Цифровая обработка сигнала'],
            ['name' => 'Микроэлектроника'],

            ['name' => 'Кватновая физика'],
            ['name' => 'Нанотехнология'],
            ['name' => 'Микросхемотехника'],
            ['name' => 'Физические основы электроники'],
            ['name' => 'Материалы электроники'],

            ['name' => 'Метрология'],
            ['name' => 'Датчики и преобразования'],
            ['name' => 'Конструирование приборов'],
            ['name' => 'Оптико-электронные приборы'],
            ['name' => 'Микроэлектронные системы'],

            ['name' => 'Теория автоматического управления'],
            ['name' => 'Промышленные контроллеры'],
            ['name' => 'Моделирование систем'],
            ['name' => 'Робототехника'],

            ['name' => 'Теория управления'],
            ['name' => 'Цифровые системы управления'],
            ['name' => 'Идентификация систем'],
            ['name' => 'Адаптивные устройства'],


    ]);
    }
}
